InformationRegisters/СпециальныеУсловияЗанятостиДолжностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СпециальныеУсловияЗанятостиДолжностей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СпециальныеУсловияЗанятостиДолжностей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

Процедура ПараметрыОбновленияИсточникаПодключаемыхХарактеристикЗарплатаКадры(ПараметрыОбновления) Экспорт
	
	ПараметрыОбновления.ИмяРегистра = "СпециальныеУсловияЗанятостиДолжностей";
	ПараметрыОбновления.ИдентификаторИсточника = "Медик";
	ПараметрыОбновления.ИмяОбъекта = "Должность";
	ПараметрыОбновления.ИмяПланаВидовХарактеристик = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДолжностиБЗКРасширенный.ИмяПланаВидовПодключаемыхХарактеристикЗарплатаКадры());
	ПараметрыОбновления.ИмяПланаВидовХарактеристик.Добавить(Справочники.ШтатноеРасписание.ИмяПланаВидовПодключаемыхХарактеристикЗарплатаКадры());
	
	Если ПараметрыОбновления.ОбновитьНаборХарактеристик Тогда
		ПараметрыОбновления.ПроверяемыеКонстанты.Добавить("РаботаВМедицинскомУчреждении");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СпециальныеУсловияЗанятостиКоллекция(Должность) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СпециальныеУсловия.Должность КАК Должность,
		|	СпециальныеУсловия.Код КАК Код,
		|	СпециальныеУсловия.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.СпециальныеУсловияЗанятостиДолжностей КАК СпециальныеУсловия
		|ГДЕ
		|	СпециальныеУсловия.Должность = &Должность
		|
		|УПОРЯДОЧИТЬ ПО
		|	СпециальныеУсловия.Код";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПредставлениеКоллекцииЗаписей(КоллекцияЗаписей) Экспорт
	
	Строки = Новый Массив;
	Для Каждого СтрокаКоллекции Из КоллекцияЗаписей Цикл
		Строки.Добавить(СтрокаКоллекции.Код + "-" + СтрокаКоллекции.Значение);
	КонецЦикла;
	
	Возврат ?(Строки.Количество(), СтрСоединить(Строки, ", "), НСтр("ru = 'Не установлены'"));
	
КонецФункции

Функция ПолучитьЗначенияЕФС1(ИмяОбласти)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		МодульГосударственнаяСлужба = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		Результат = МодульГосударственнаяСлужба.СписокВыбораЗначениеПоказателейЕФС1(ИмяОбласти);
	Иначе
		Результат = Новый ТаблицаЗначений;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КодыУсловий() Экспорт
	
	Результат = Новый СписокЗначений;
	
	Коды = ПолучитьЗначенияЕФС1("КодыУсловийЗанятости");
	Для Каждого Строка Из Коды Цикл
		Если Строка.Код = "" Или Строка.Код = "0" Тогда
			Продолжить;
		КонецЕсли;
		Результат.Добавить(Строка.Код, СтрШаблон("%1 - %2", Строка.Код, Строка.Название));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначенияКода(Код) Экспорт
	
	Результат = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(Код) Тогда
		Значения = ПолучитьЗначенияЕФС1("ЗначенияКода" + Код);
		Для Каждого Строка Из Значения Цикл
			Если Строка.Код = "" Тогда
				Продолжить;
			КонецЕсли;
			Результат.Добавить(Строка.Код, СтрШаблон("%1 - %2", Строка.Код, Строка.Название));
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
